ChangeName
Syntax
SapObject.SapModel.LoadPatterns.ChangeName
VB6 Procedure
Function ChangeName(ByVal Name As String, ByVal NewName As String) As Long
Parameters
Name
The name of a defined load pattern.
NewName
The new name for the load pattern.
Remarks
This function applies a new name to a load pattern.
The function returns zero if the new name is successfully applied; otherwise it returns a nonzero value.
VBA Example
Sub ChangeLoadPatternName()
 'dimension variables
 Dim SapObject as cOAPI
 Dim SapModel As cSapModel
 Dim ret As Long
 Dim Name As String
 'create Sap2000 object
 Set SapObject = New Sap2000v16.SapObject
 'start Sap2000 application
 SapObject.ApplicationStart
 'create SapModel object
 Set SapModel = SapObject.SapModel
 'initialize model
 ret = SapModel.InitializeNewModel
 'create model from template
 ret = SapModel.File.New2DFrame(PortalFrame, 2, 144, 2, 288)
 'change name
 ret = SapModel.LoadPatterns.ChangeName("DEAD", "DL")
 'close Sap2000
 SapObject.ApplicationExit False
 Set SapModel = Nothing
 Set SapObject = Nothing
 End Sub
Release Notes
Initial release in version 11.01.
Changed nomenclature from Load Cases, Analysis Cases and Response Combinations to Load Patterns, Load Cases and Load Combinations, respectively, in version 12.00.
See Also